### Terraform Plan for `dev` Environment

<details>
<summary>Show Plan</summary>

```hcl

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_artifact_registry_repository.frontend will be created
  + resource "google_artifact_registry_repository" "frontend" {
      + create_time      = (known after apply)
      + description      = "Docker repository for frontend service images"
      + effective_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + format           = "DOCKER"
      + id               = (known after apply)
      + location         = "europe-west1"
      + mode             = "STANDARD_REPOSITORY"
      + name             = (known after apply)
      + project          = "web-app-demo-dev"
      + registry_uri     = (known after apply)
      + repository_id    = "frontend"
      + terraform_labels = {
          + "goog-terraform-provisioned" = "true"
        }
      + update_time      = (known after apply)

      + docker_config {
          + immutable_tags = false
        }

      + vulnerability_scanning_config (known after apply)
    }

  # google_cloud_run_v2_service.backend will be updated in-place
  ~ resource "google_cloud_run_v2_service" "backend" {
      - client                  = "gcloud" -> null
      - client_version          = "557.0.0" -> null
        id                      = "projects/web-app-demo-dev/locations/europe-west1/services/backend"
        name                    = "backend"
        # (32 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # google_cloud_run_v2_service.frontend will be created
  + resource "google_cloud_run_v2_service" "frontend" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + deletion_protection     = true
      + effective_annotations   = (known after apply)
      + effective_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west1"
      + name                    = "frontend"
      + observed_generation     = (known after apply)
      + project                 = "web-app-demo-dev"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = {
          + "goog-terraform-provisioned" = "true"
        }
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)
      + urls                    = (known after apply)

      + scaling (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + build_info = (known after apply)
              + image      = "us-docker.pkg.dev/cloudrun/container/hello"

              + ports {
                  + container_port = 8080
                  + name           = (known after apply)
                }

              + resources {
                  + limits = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                }

              + startup_probe (known after apply)
            }

          + scaling {
              + max_instance_count = 5
              + min_instance_count = 0
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

  # google_cloud_run_v2_service_iam_member.frontend_public_access will be created
  + resource "google_cloud_run_v2_service_iam_member" "frontend_public_access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "allUsers"
      + name     = "frontend"
      + project  = "web-app-demo-dev"
      + role     = "roles/run.invoker"
    }

Plan: 3 to add, 1 to change, 0 to destroy.

Changes to Outputs:
  + frontend_service_url = (known after apply)

```

</details>

*Pusher: @Copilot, Action: `pull_request`, Working Directory: `infrastructure/env`, Workflow: `Pull Request`*